
#2.NoneType - ничего пустота -> NoneType
#3. Boolean - истина или ложь -> True/False
#4 String -строки -str -> "Hello world", 'Hello world'
#5. Числовые типы данных
   #a) integer - целое число int -> 0,2, 555
   #b) float - число с плавующей точкой -> 2.5, 15.25
   #c)complex - 1j: 1, 5-9j
#6.Списковые типы данных (коллекция)
  #a) list(масив/список) -> [6, 2, 4, True, 'hello']
  #b) tuple(кортеж) -> (2, 2, 3, None)
  #c) range(последовательность) -> range(2, 10)
#7) set() - множество ->{1,2,3,4,5,6,7,8,}
#8) dict(словари) -> содержат данные в себе в виде ключа и значение {1: 'one', 2: 'two'}
#-----------------------------------------------------------------------

#Mutable(изменяемые типы данных)
#2. List
#3. set
#4. dict
# Immutable(неизменяемые типы данных)
#2. None 
#3. bool
#4. int, float, complex
#5. str
#6. tuple, range
#7. frozenset
#-----------------------------------------------------------------------
# переменная - проименованная область памяти, предназначеная для хранения данных.С её помощью мы можем проводить различные операции с данными
# num = 6
# str2 = "Hello world!"
# '''
# Стандартный вывод данных
# '''
#  в питоне для вывода данных в терминал используется встроенная функция print()
# stroka = "Hello world! My name is John Snow!"
# print(stroka)



# labels = ['Honda', 'Kawasaki']
# for x in labels:
#     print(f'I like brand {x}')